## Movie Data

In [30]:
import pandas as pd
import sqlite3
import matplotlib.pyplot as plt

In [31]:
!ls ../zippedData/

bom.movie_gross.csv.gz
im.db
im.db.zip
rt.movie_info.tsv.gz
rt.reviews.tsv.gz
tmdb.movies.csv.gz
tn.movie_budgets.csv.gz

In [108]:
!ls ../zippedData

bom.movie_gross.csv.gz
im.db
im.db.zip
im2.db
rt.movie_info.tsv.gz
rt.reviews.tsv.gz
tmdb.movies.csv.gz
tn.movie_budgets.csv.gz

## IMDB MOVIE BASICS

In [109]:
conn = sqlite3.connect('../zippedData/im2.db')

In [111]:
pd.read_sql("SELECT * FROM sqlite_master", conn)

,type,name,tbl_name,rootpage,sql
0,table,movie_basics,movie_basics,2,"CREATE TABLE ""movie_basics"" (\n""movie_id"" TEXT..."
1,table,directors,directors,3,"CREATE TABLE ""directors"" (\n""movie_id"" TEXT,\n..."
2,table,known_for,known_for,4,"CREATE TABLE ""known_for"" (\n""person_id"" TEXT,\..."
3,table,movie_akas,movie_akas,5,"CREATE TABLE ""movie_akas"" (\n""movie_id"" TEXT,\..."
4,table,movie_ratings,movie_ratings,6,"CREATE TABLE ""movie_ratings"" (\n""movie_id"" TEX..."
5,table,persons,persons,7,"CREATE TABLE ""persons"" (\n""person_id"" TEXT,\n ..."
6,table,principals,principals,8,"CREATE TABLE ""principals"" (\n""movie_id"" TEXT,\..."
7,table,writers,writers,9,"CREATE TABLE ""writers"" (\n""movie_id"" TEXT,\n ..."

In [114]:
imdb_basics = pd.read_sql("SELECT * FROM movie_basics", conn)
imdb_basics.head()

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

## MOVIE GROSS

In [32]:
movie_gross = pd.read_csv("../zippedData/bom.movie_gross.csv.gz")
movie_gross.head(2)

                        title studio  domestic_gross foreign_gross  year
0                 Toy Story 3     BV     415000000.0     652000000  2010
1  Alice in Wonderland (2010)     BV     334200000.0     691300000  2010

In [92]:
movie_gross

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010
...,...,...,...,...,...
3382,The Quake,Magn.,6200.0,NaN,2018
3383,Edward II (2018 re-release),FM,4800.0,NaN,2018
3384,El Pacto,Sony,2500.0,NaN,2018
3385,The Swan,Synergetic,2400.0,NaN,2018
3386,An Actor Prepares,Grav.,1700.0,NaN,2018

In [91]:
movie_gross[movie_gross['title'] == 'Avatar']
#how to find the a specific movie

Empty DataFrame
Columns: [title, studio, domestic_gross, foreign_gross, year]
Index: []

In [35]:
type(movie_gross)

pandas.core.frame.DataFrame

In [36]:
movie_gross.index

RangeIndex(start=0, stop=3387, step=1)

In [118]:
movie_gross['foreign_gross'].sort_values(ascending=False)

1331      99700
1805      99700
302       99600
510     9900000
3181    9900000
         ...
3382        NaN
3383        NaN
3384        NaN
3385        NaN
3386        NaN
Name: foreign_gross, Length: 3387, dtype: object

In [41]:
movie_gross.columns

Index(['title', 'studio', 'domestic_gross', 'foreign_gross', 'year'], dtype='object')

In [42]:
movie_gross.values

array([['Toy Story 3', 'BV', 415000000.0, '652000000', 2010],
       ['Alice in Wonderland (2010)', 'BV', 334200000.0, '691300000',
        2010],
       ['Harry Potter and the Deathly Hallows Part 1', 'WB', 296000000.0,
        '664300000', 2010],
       ...,
       ['El Pacto', 'Sony', 2500.0, nan, 2018],
       ['The Swan', 'Synergetic', 2400.0, nan, 2018],
       ['An Actor Prepares', 'Grav.', 1700.0, nan, 2018]], dtype=object)

In [44]:
movie_gross.describe()

       domestic_gross         year
count    3.359000e+03  3387.000000
mean     2.874585e+07  2013.958075
std      6.698250e+07     2.478141
min      1.000000e+02  2010.000000
25%      1.200000e+05  2012.000000
50%      1.400000e+06  2014.000000
75%      2.790000e+07  2016.000000
max      9.367000e+08  2018.000000

In [45]:
movie_gross.shape

(3387, 5)

In [46]:
movie_gross.mean()

domestic_gross    2.874585e+07
year              2.013958e+03
dtype: float64

In [47]:
movie_gross.min()

title              '71
domestic_gross     100
year              2010
dtype: object

In [48]:
movie_gross.max()

title             xXx: The Return of Xander Cage
domestic_gross                         9.367e+08
year                                        2018
dtype: object

In [49]:
df.describe(include=[object])

            title studio foreign_gross
count        3387   3382          2037
unique       3386    257          1204
top     Bluebeard    IFC       1200000
freq            2    166            23

In [51]:
movie_gross.head(1)

         title studio  domestic_gross foreign_gross  year
0  Toy Story 3     BV     415000000.0     652000000  2010

In [ ]:
movie_gross['tot_gross'] = movie_gross['foreign_gross'] + movie_gross['domestic_gross']

In [ ]:
movie_gross['domestic_gross'] >= 500000000

In [54]:
sum(movie_gross['domestic_gross'] >= 500000000)

9

In [57]:
big_bucks = movie_gross.loc[movie_gross['domestic_gross'] >= 500000000]

In [58]:
big_bucks

                             title studio  domestic_gross foreign_gross  year
727          Marvel's The Avengers     BV     623400000.0     895500000  2012
1872  Star Wars: The Force Awakens     BV     936700000.0       1,131.6  2015
1873                Jurassic World   Uni.     652300000.0       1,019.4  2015
2323  Rogue One: A Star Wars Story     BV     532200000.0     523900000  2016
2758      Star Wars: The Last Jedi     BV     620200000.0     712400000  2017
2759   Beauty and the Beast (2017)     BV     504000000.0     759500000  2017
3079        Avengers: Infinity War     BV     678800000.0       1,369.5  2018
3080                 Black Panther     BV     700100000.0     646900000  2018
3082                 Incredibles 2     BV     608600000.0     634200000  2018

In [62]:
movie_gross['year'].value_counts()
#change the variable out to get different counts for them all.

2015    450
2016    436
2012    400
2011    399
2014    395
2013    350
2010    328
2017    321
2018    308
Name: year, dtype: int64

In [67]:
movie_gross['studio'].sort_values()

155      3D
1457    A23
670     A23
1693    A24
1717    A24
       ...
210     NaN
555     NaN
933     NaN
1862    NaN
2825    NaN
Name: studio, Length: 3387, dtype: object

In [70]:
movie_gross.sort_values(by='domestic_gross')

,title,studio,domestic_gross,foreign_gross,year
1476,Storage 24,Magn.,100.0,NaN,2013
2321,The Chambermaid,FM,300.0,NaN,2015
2756,News From Planet Mars,KL,300.0,NaN,2016
2757,Satanic,Magn.,300.0,NaN,2016
1018,Apartment 143,Magn.,400.0,426000,2012
...,...,...,...,...,...
1975,Surprise - Journey To The West,AR,NaN,49600000,2015
2392,Finding Mr. Right 2,CL,NaN,114700000,2016
2468,Solace,LGP,NaN,22400000,2016
2595,Viral,W/Dim.,NaN,552000,2016
2825,Secret Superstar,NaN,NaN,122000000,2017

In [ ]:
sum(movie_gross['foreign_gross'] >= 500000000)

## MOVIE INFO

In [16]:
movie_info = pd.read_csv("../zippedData/rt.movie_info.tsv.gz", sep="\t")

In [72]:
movie_info.head(1)

,id,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
0,1,"This gritty, fast-paced, and innovative police...",R,Action and Adventure|Classics|Drama,William Friedkin,Ernest Tidyman,"Oct 9, 1971","Sep 25, 2001",NaN,NaN,104 minutes,NaN

In [73]:
movie_info.tail(1)

,id,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
1559,2000,"Suspended from the force, Paris cop Hubert is ...",R,Action and Adventure|Art House and Internation...,NaN,Luc Besson,"Sep 27, 2001","Feb 11, 2003",NaN,NaN,94 minutes,Columbia Pictures

In [74]:
type(movie_info)

pandas.core.frame.DataFrame

In [75]:
movie_info.index

RangeIndex(start=0, stop=1560, step=1)

In [76]:
movie_info.columns

Index(['id', 'synopsis', 'rating', 'genre', 'director', 'writer',
       'theater_date', 'dvd_date', 'currency', 'box_office', 'runtime',
       'studio'],
      dtype='object')

In [78]:
movie_info.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1560 entries, 0 to 1559
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            1560 non-null   int64
 1   synopsis      1498 non-null   object
 2   rating        1557 non-null   object
 3   genre         1552 non-null   object
 4   director      1361 non-null   object
 5   writer        1111 non-null   object
 6   theater_date  1201 non-null   object
 7   dvd_date      1201 non-null   object
 8   currency      340 non-null    object
 9   box_office    340 non-null    object
 10  runtime       1530 non-null   object
 11  studio        494 non-null    object
dtypes: int64(1), object(11)
memory usage: 146.4+ KB

In [79]:
movie_info.describe()

                id
count  1560.000000
mean   1007.303846
std     579.164527
min       1.000000
25%     504.750000
50%    1007.500000
75%    1503.250000
max    2000.000000

In [80]:
movie_info.shape

(1560, 12)

In [82]:
movie_info.describe(include=[object])

,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
count,1498,1557,1552,1361,1111,1201,1201,340,340,1530,494
unique,1497,6,299,1125,1069,1025,717,1,336,142,200
top,A group of air crash survivors are stranded in...,R,Drama,Steven Spielberg,Woody Allen,"Jan 1, 1987","Jun 1, 2004",$,"32,000,000",90 minutes,Universal Pictures
freq,2,521,151,10,4,8,11,340,2,72,35

## REVIEWS

In [18]:
reviews = pd.read_csv("../zippedData/rt.reviews.tsv.gz", sep="\t", encoding="ISO-8859-1")

In [83]:
reviews.head(1)

,id,review,rating,fresh,critic,top_critic,publisher,date
0,3,A distinctly gallows take on contemporary fina...,3/5,fresh,PJ Nabarro,0,Patrick Nabarro,"November 10, 2018"

In [84]:
reviews.tail(1)

,id,review,rating,fresh,critic,top_critic,publisher,date
54431,2000,NaN,3/5,fresh,Nicolas Lacroix,0,Showbizz.net,"November 12, 2002"

## TMDB MOVIES

In [21]:
tmdb_mov = pd.read_csv("../zippedData/tmdb.movies.csv.gz")

In [22]:
tmdb_mov.head(1)

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788

In [85]:
tmdb_mov.tail(1)

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
26516,26516,"[53, 27]",309885,en,The Church,0.6,2018-10-05,The Church,0.0,1

## MOVIE BUDGETS

In [23]:
budg_mov = pd.read_csv("../zippedData/tn.movie_budgets.csv.gz")

In [24]:
budg_mov.head(1)

   id  release_date   movie production_budget domestic_gross worldwide_gross
0   1  Dec 18, 2009  Avatar      $425,000,000   $760,507,625  $2,776,345,279

In [86]:
budg_mov.tail(1)

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
5781,82,"Aug 5, 2005",My Date With Drew,"$1,100","$181,041","$181,041"

In [97]:
budg_mov.mean()

id    50.372363
dtype: float64

In [98]:
budg_mov.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   object
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB

In [99]:
budg_mov.describe()

                id
count  5782.000000
mean     50.372363
std      28.821076
min       1.000000
25%      25.000000
50%      50.000000
75%      75.000000
max     100.000000

In [100]:
budg_mov.describe(include=[object])

,release_date,movie,production_budget,domestic_gross,worldwide_gross
count,5782,5782,5782,5782,5782
unique,2418,5698,509,5164,5356
top,"Dec 31, 2014",King Kong,"$20,000,000",$0,$0
freq,24,3,231,548,367

In [101]:
budg_mov.shape

(5782, 6)

In [106]:
budg_mov['domestic_gross']

0       $760,507,625
1       $241,063,875
2        $42,762,350
3       $459,005,868
4       $620,181,382
            ...
5777              $0
5778         $48,482
5779          $1,338
5780              $0
5781        $181,041
Name: domestic_gross, Length: 5782, dtype: object

In [107]:
budg_mov['worldwide_gross']

0       $2,776,345,279
1       $1,045,663,875
2         $149,762,350
3       $1,403,013,963
4       $1,316,721,747
             ...
5777                $0
5778          $240,495
5779            $1,338
5780                $0
5781          $181,041
Name: worldwide_gross, Length: 5782, dtype: object

In [6]:
conn = sqlite3.connect("..\zippedData\im.db")

OperationalError: unable to open database file

In [7]:
pd.read_sql('''
SELECT *
FROM sqlite_master
''', conn)

NameError: name 'conn' is not defined

In [8]:
pd.read_sql("SELECT * FROM movie_basics", conn)

NameError: name 'conn' is not defined